In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import datasets  
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.tree import  DecisionTreeClassifier
from sklearn import tree
from sklearn.metrics import classification_report

In [2]:
rf_fchek= pd.read_csv('C:\\Users\\sathya\\Documents\\assignments\\Fraud_check.csv')

In [3]:
rf_fchek.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO

In [4]:
rf_fchek.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int64(3), object(3)
memory usage: 28.2+ KB

In [5]:
rf_fchek.describe()

       Taxable.Income  City.Population  Work.Experience
count      600.000000       600.000000       600.000000
mean     55208.375000    108747.368333        15.558333
std      26204.827597     49850.075134         8.842147
min      10003.000000     25779.000000         0.000000
25%      32871.500000     66966.750000         8.000000
50%      55074.500000    106493.500000        15.000000
75%      78611.750000    150114.250000        24.000000
max      99619.000000    199778.000000        30.000000

In [6]:
rf_fchek.shape

(600, 6)

rf_fchek.dropna()

In [7]:

rf_fchek.loc[rf_fchek["Taxable.Income"]>=30000,"Income"]="Good Description"
rf_fchek.loc[rf_fchek["Taxable.Income"]<=30000,"Income"]="Risky"

In [8]:
rf_fchek.head(100)

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban,Income
0,NO,Single,68833,50047,10,YES,Good Description
1,YES,Divorced,33700,134075,18,YES,Good Description
2,NO,Married,36925,160205,30,YES,Good Description
3,YES,Single,50190,193264,15,YES,Good Description
4,NO,Married,81002,27533,28,NO,Good Description
...,...,...,...,...,...,...,...
95,YES,Single,41395,121498,28,YES,Good Description
96,NO,Single,22258,63622,17,NO,Risky
97,YES,Divorced,79583,37849,19,YES,Good Description
98,YES,Married,22187,77053,18,YES,Risky
99,NO,Married,52495,114350,12,NO,Good Description

In [9]:
rf_fchek.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
 6   Income           600 non-null    object
dtypes: int64(3), object(4)
memory usage: 32.9+ KB

In [10]:
from sklearn import preprocessing
le=preprocessing.LabelEncoder()
for column_name in rf_fchek.columns:
    if rf_fchek[column_name].dtype == object:
        rf_fchek[column_name] = le.fit_transform(rf_fchek[column_name])
    else:
        pass

In [11]:
rf_fchek.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    int32
 1   Marital.Status   600 non-null    int32
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    int32
 6   Income           600 non-null    int32
dtypes: int32(4), int64(3)
memory usage: 23.6 KB

In [12]:
#Droping the Taxable income variable - we taken that as Income description
rf_fchek.drop(["Taxable.Income"],axis=1,inplace=True)

In [13]:
## Collecting the column names
colnames = list(rf_fchek.columns)
colnames

['Undergrad',
 'Marital.Status',
 'City.Population',
 'Work.Experience',
 'Urban',
 'Income']

In [14]:
x= rf_fchek.iloc[:,0:5]
y= rf_fchek.iloc[:,5]

In [15]:
x

     Undergrad  Marital.Status  City.Population  Work.Experience  Urban
0            0               2            50047               10      1
1            1               0           134075               18      1
2            0               1           160205               30      1
3            1               2           193264               15      1
4            0               1            27533               28      0
..         ...             ...              ...              ...    ...
595          1               0            39492                7      1
596          1               0            55369                2      1
597          0               0           154058                0      1
598          1               1           180083               17      0
599          0               0           158137               16      0

[600 rows x 5 columns]

In [16]:
y

0      0
1      0
2      0
3      0
4      0
      ..
595    0
596    0
597    0
598    0
599    0
Name: Income, Length: 600, dtype: int32

In [17]:
# Splitting data into training and testing data set
x_train, x_test,y_train,y_test = train_test_split(x,y, test_size=0.2,random_state=40)

In [18]:
model = DecisionTreeClassifier(criterion = 'entropy',max_depth=8)
model.fit(x_train,y_train)

DecisionTreeClassifier(criterion='entropy', max_depth=8)

In [19]:
model.get_n_leaves()

39

In [20]:
from pandas import read_csv
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
from sklearn.ensemble import RandomForestClassifier

names = ['Undergrad','Marital.Status','City.Population','Work.Experience','Urban','Income']
#dataframe = read_csv("C:\\Users\\sathya\\Documents\\datascience\\pima-indians-diabetes.data.csv", names=names)

array = rf_fchek.values
X = array[:,0:5]
Y = array[:,5]
num_trees = 100
max_features = 3
kfold = KFold(n_splits=10, random_state=7)
model = RandomForestClassifier(n_estimators=num_trees, max_features=max_features)
results = cross_val_score(model, X, Y, cv=kfold)
print(results.mean())

C:\Users\sathya\anaconda3\lib\site-packages\sklearn\model_selection\_split.py:293: FutureWarning: Setting a random_state has no effect since shuffle is False. This will raise an error in 0.24. You should leave random_state to its default (None), or set shuffle=True.
  warnings.warn(

0.7433333333333334